out.log
Phase started: Warm up (index: 0, duration: 1s) 17:11:37(+0530)

Phase completed: Warm up (index: 0, duration: 1s) 17:11:38(+0530)

homeScreenResponse {"status":200,"message":"Success","userDetails":{"userId":"613f9f2f23de746c8333e23f","new_wallet":{"silver":3,"gold":3,"updatedAt":"2022-04-01T18:30:00.684Z"}},"activityHistory":[{"_id":"60e4a0e5b3029fa76a43822d","new_price":{"silver":0,"gold":200},"name":"Hang out","category":"lifestyle","icon":"https://ether-network.s3.ap-south-1.amazonaws.com/png/048-conversation.png","isGold":true,"isSilver":false,"count":4}],"timeslots":[]}
--------------------------------------
Metrics for period to: 17:11:40(+0530) (width: 0.087s)
--------------------------------------

http.codes.200: ................................................................ 2
http.request_rate: ............................................................. 2/sec
http.requests: ................................................................. 2
http.response_time:
  min: ......................................................................... 26
  max: ......................................................................... 30
  median: ...................................................................... 25.8
  p95: ......................................................................... 25.8
  p99: ......................................................................... 25.8
http.responses: ................................................................ 2
vusers.completed: .............................................................. 1
vusers.created: ................................................................ 1
vusers.created_by_name.0: ...................................................... 1
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 87.5
  max: ......................................................................... 87.5
  median: ...................................................................... 87.4
  p95: ......................................................................... 87.4
  p99: ......................................................................... 87.4


All VUs finished. Total time: 2 seconds

--------------------------------
Summary report @ 17:11:39(+0530)
--------------------------------

http.codes.200: ................................................................ 2
http.request_rate: ............................................................. 2/sec
http.requests: ................................................................. 2
http.response_time:
  min: ......................................................................... 26
  max: ......................................................................... 30
  median: ...................................................................... 25.8
  p95: ......................................................................... 25.8
  p99: ......................................................................... 25.8
http.responses: ................................................................ 2
vusers.completed: .............................................................. 1
vusers.created: ................................................................ 1
vusers.created_by_name.0: ...................................................... 1
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 87.5
  max: ......................................................................... 87.5
  median: ...................................................................... 87.4
  p95: ......................................................................... 87.4
  p99: ......................................................................... 87.4
Phase started: Warm up (index: 0, duration: 1s) 17:38:16(+0530)

Phase completed: Warm up (index: 0, duration: 1s) 17:38:17(+0530)

613f9f2f23de746c8333e23f
homeScreenResponse {"status":200,"message":"Success","userDetails":{"userId":"613f9f2f23de746c8333e23f","new_wallet":{"silver":3,"gold":3,"updatedAt":"2022-04-01T18:30:00.684Z"}},"activityHistory":[{"_id":"60e4a0e5b3029fa76a43822d","new_price":{"silver":0,"gold":200},"name":"Hang out","category":"lifestyle","icon":"https://ether-network.s3.ap-south-1.amazonaws.com/png/048-conversation.png","isGold":true,"isSilver":false,"count":4}],"timeslots":[]}
--------------------------------------
Metrics for period to: 17:38:20(+0530) (width: 0.063s)
--------------------------------------

http.codes.200: ................................................................ 1
http.request_rate: ............................................................. 1/sec
http.requests: ................................................................. 1
http.response_time:
  min: ......................................................................... 40
  max: ......................................................................... 40
  median: ...................................................................... 40
  p95: ......................................................................... 40
  p99: ......................................................................... 40
http.responses: ................................................................ 1
vusers.completed: .............................................................. 1
vusers.created: ................................................................ 1
vusers.created_by_name.0: ...................................................... 1
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 62.4
  max: ......................................................................... 62.4
  median: ...................................................................... 62.2
  p95: ......................................................................... 62.2
  p99: ......................................................................... 62.2


All VUs finished. Total time: 2 seconds

--------------------------------
Summary report @ 17:38:18(+0530)
--------------------------------

http.codes.200: ................................................................ 1
http.request_rate: ............................................................. 1/sec
http.requests: ................................................................. 1
http.response_time:
  min: ......................................................................... 40
  max: ......................................................................... 40
  median: ...................................................................... 40
  p95: ......................................................................... 40
  p99: ......................................................................... 40
http.responses: ................................................................ 1
vusers.completed: .............................................................. 1
vusers.created: ................................................................ 1
vusers.created_by_name.0: ...................................................... 1
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 62.4
  max: ......................................................................... 62.4
  median: ...................................................................... 62.2
  p95: ......................................................................... 62.2
  p99: ......................................................................... 62.2
Phase started: Warm up (index: 0, duration: 1s) 17:40:21(+0530)

Phase completed: Warm up (index: 0, duration: 1s) 17:40:22(+0530)

613f9f2f23de746c8333e23f
homeScreenResponse {"messsage":"Please Refresh your Auth Token."}
--------------------------------------
Metrics for period to: 17:40:30(+0530) (width: 0.042s)
--------------------------------------

http.codes.401: ................................................................ 1
http.request_rate: ............................................................. 1/sec
http.requests: ................................................................. 1
http.response_time:
  min: ......................................................................... 14
  max: ......................................................................... 14
  median: ...................................................................... 13.9
  p95: ......................................................................... 13.9
  p99: ......................................................................... 13.9
http.responses: ................................................................ 1
vusers.completed: .............................................................. 1
vusers.created: ................................................................ 1
vusers.created_by_name.0: ...................................................... 1
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 42.3
  max: ......................................................................... 42.3
  median: ...................................................................... 42.5
  p95: ......................................................................... 42.5
  p99: ......................................................................... 42.5


All VUs finished. Total time: 2 seconds

--------------------------------
Summary report @ 17:40:23(+0530)
--------------------------------

http.codes.401: ................................................................ 1
http.request_rate: ............................................................. 1/sec
http.requests: ................................................................. 1
http.response_time:
  min: ......................................................................... 14
  max: ......................................................................... 14
  median: ...................................................................... 13.9
  p95: ......................................................................... 13.9
  p99: ......................................................................... 13.9
http.responses: ................................................................ 1
vusers.completed: .............................................................. 1
vusers.created: ................................................................ 1
vusers.created_by_name.0: ...................................................... 1
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 42.3
  max: ......................................................................... 42.3
  median: ...................................................................... 42.5
  p95: ......................................................................... 42.5
  p99: ......................................................................... 42.5